src/cfe/package-manager/Catalogs/пм_ИсточникиПакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пм_ИсточникиПакетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пм_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/package-manager/CommonModules/пм_ПровайдерGitHub/Ext/Module.bsl
#Если Сервер Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет доступность репозитория и кэширует его идентификатор.
// Реализация контракта провайдера, см. пм_ПровайдерыПакетов.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//
// Возвращаемое значение:
//  Структура - Результат проверки:
// * Успешно - Булево
// * ТекстОшибки - Строка
// * IDПроекта - Строка
//
Функция ПроверитьИсточник(Источник) Экспорт

	Результат = Новый Структура("Успешно, ТекстОшибки, IDПроекта", Ложь, "", "");

	Попытка
		ОбеспечитьIDПроекта(Источник);
		Результат.IDПроекта = Источник.IDПроекта;
		Результат.Успешно = Истина;
	Исключение
		Результат.ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Собирает каталог пакетов из ассетов GitHub Releases.
// Имя пакета - имя файла .cfe/.epf/.erf без расширения.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//
// Возвращаемое значение:
//  Соответствие - Ключ packages: массив описаний с ключом name.
//
Функция ПрочитатьКаталог(Источник) Экспорт

	ОбеспечитьIDПроекта(Источник);

	Имена = УникальныеИменаПакетовИзРелизов(ПолучитьРелизы(Источник));

	Если ЗначениеЗаполнено(Источник.ИмяПакета) Тогда
		Отобранные = Новый Массив;
		Для Каждого ИмяПакета Из Имена Цикл
			Если СтрСравнить(ИмяПакета, Источник.ИмяПакета) = 0 Тогда
				Отобранные.Добавить(ИмяПакета);
			КонецЕсли;
		КонецЦикла;
		Имена = Отобранные;
	КонецЕсли;

	Пакеты = Новый Массив;
	Для Каждого ИмяПакета Из Имена Цикл
		ОписаниеПакета = Новый Соответствие;
		ОписаниеПакета.Вставить("name", ИмяПакета);
		Пакеты.Добавить(ОписаниеПакета);
	КонецЦикла;

	Каталог = Новый Соответствие;
	Каталог.Вставить("packages", Пакеты);

	Возврат Каталог;

КонецФункции

// Адрес GitHub API для указанного сервера.
// github.com ведет на api.github.com, свой хост - на /api/v3.
//
// Параметры:
//  URLСервера - Строка - Адрес из источника.
//
// Возвращаемое значение:
//  Строка - Базовый адрес API без завершающего слеша.
//
Функция АдресПрограммногоИнтерфейса(Знач URLСервера) Экспорт

	URL = пм_МенеджерПакетовКлиентСервер.НормализованныйURL(URLСервера);
	Если Не ЗначениеЗаполнено(URL) Тогда
		Возврат "";
	КонецЕсли;

	Если ЭтоХостGitHubCom(ХостИзURL(URL)) Тогда
		Возврат "https://api.github.com";
	КонецЕсли;

	Если СтрЗаканчиваетсяНа(НРег(URL), "/api/v3") Тогда
		Возврат URL;
	КонецЕсли;

	Возврат URL + "/api/v3";

КонецФункции

// Разбивает путь owner/repo. Хвост .git отбрасывается.
//
// Параметры:
//  Путь - Строка - Путь проекта из источника.
//
// Возвращаемое значение:
//  Массив - Сегменты пути после нормализации.
//
Функция СегментыПутиРепозитория(Знач Путь) Экспорт

	Нормализованный = пм_МенеджерПакетовКлиентСервер.НормализованныйПутьПроекта(Путь);
	Если Не ЗначениеЗаполнено(Нормализованный) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Сегменты = СтрРазделить(Нормализованный, "/", Ложь);
	Если Сегменты.Количество() >= 2 И СтрЗаканчиваетсяНа(НРег(Сегменты[1]), ".git") Тогда
		Сегменты[1] = Лев(Сегменты[1], СтрДлина(Сегменты[1]) - 4);
	КонецЕсли;

	Возврат Сегменты;

КонецФункции

// Номер версии из тега релиза: ведущая v перед цифрой снимается.
//
// Параметры:
//  Тег - Строка - tag_name релиза.
//
// Возвращаемое значение:
//  Строка - Номер версии для сравнения и отображения.
//
Функция НомерВерсииИзТега(Знач Тег) Экспорт

	Тег = СокрЛП(Строка(Тег));
	Если СтрДлина(Тег) < 2 Тогда
		Возврат Тег;
	КонецЕсли;

	ПервыйСимвол = Лев(Тег, 1);
	Если (ПервыйСимвол = "v" Или ПервыйСимвол = "V")
		И СтрНайти("0123456789", Сред(Тег, 2, 1)) > 0 Тогда
		Возврат Сред(Тег, 2);
	КонецЕсли;

	Возврат Тег;

КонецФункции

// Уникальные имена пакетов из релизов GitHub.
// Черновики и файлы неизвестного типа пропускаются.
//
// Параметры:
//  Релизы - Массив - Соответствия релизов GitHub API.
//
// Возвращаемое значение:
//  Массив - Имена пакетов без повторов, в порядке первого появления.
//
Функция УникальныеИменаПакетовИзРелизов(Релизы) Экспорт

	Имена = Новый Массив;
	УжеЕсть = Новый Соответствие;

	Если Релизы = Неопределено Тогда
		Возврат Имена;
	КонецЕсли;

	Для Каждого Релиз Из Релизы Цикл

		Если ЭтоЧерновик(Релиз) Тогда
			Продолжить;
		КонецЕсли;

		Для Каждого Ассет Из АссетыРелиза(Релиз) Цикл
			ИмяПакета = пм_МенеджерПакетов.ИмяПакетаИзИмениФайла(Ассет.Получить("name"));
			Если Не ЗначениеЗаполнено(ИмяПакета) Или УжеЕсть.Получить(НРег(ИмяПакета)) = Истина Тогда
				Продолжить;
			КонецЕсли;
			УжеЕсть.Вставить(НРег(ИмяПакета), Истина);
			Имена.Добавить(ИмяПакета);
		КонецЦикла;

	КонецЦикла;

	Возврат Имена;

КонецФункции

// Версии пакета из уже загруженных релизов. Сеть не вызывается.
//
// Параметры:
//  Релизы - Массив - Соответствия релизов GitHub API.
//  ИмяПакета - Строка - Имя package.
//  ТипРелиза - Строка - stable, rc, dev либо пустая строка.
//  ЛимитВерсий - Число - Сколько версий вернуть, 0 без ограничения.
//
// Возвращаемое значение:
//  Массив - Соответствия с ключами id, version, created_at.
//
Функция ВерсииПакетаИзРелизов(Релизы, ИмяПакета, ТипРелиза = "", ЛимитВерсий = 0) Экспорт

	Версии = Новый Массив;

	Если Релизы = Неопределено Тогда
		Возврат Версии;
	КонецЕсли;

	Для Каждого Релиз Из Релизы Цикл

		Если ЭтоЧерновик(Релиз) Или Не РелизСодержитПакет(Релиз, ИмяПакета) Тогда
			Продолжить;
		КонецЕсли;

		НомерВерсии = НомерВерсииИзТега(Релиз.Получить("tag_name"));
		Если Не пм_ВерсииПакетов.ВерсияПодходитПодФильтр(НомерВерсии, ТипРелиза) Тогда
			Продолжить;
		КонецЕсли;

		Версия = Новый Соответствие;
		Версия.Вставить("id", Релиз.Получить("id"));
		Версия.Вставить("version", НомерВерсии);
		Версия.Вставить("created_at", ДатаРелиза(Релиз));
		Версии.Добавить(Версия);

		Если ЛимитВерсий > 0 И Версии.Количество() >= ЛимитВерсий Тогда
			Возврат Версии;
		КонецЕсли;

	КонецЦикла;

	Возврат Версии;

КонецФункции

// Файлы релиза в контракте менеджера: ключ file_name.
//
// Параметры:
//  Релиз - Соответствие - Ответ GitHub API по одному релизу.
//
// Возвращаемое значение:
//  Массив - Соответствия с ключами file_name и id.
//
Функция ФайлыРелиза(Релиз) Экспорт

	Файлы = Новый Массив;

	Для Каждого Ассет Из АссетыРелиза(Релиз) Цикл
		ИмяФайла = Ассет.Получить("name");
		Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
			Продолжить;
		КонецЕсли;
		Файл = Новый Соответствие;
		Файл.Вставить("file_name", ИмяФайла);
		Файл.Вставить("id", Ассет.Получить("id"));
		Файлы.Добавить(Файл);
	КонецЦикла;

	Возврат Файлы;

КонецФункции

// Возвращает версии пакета, отфильтрованные по типу релиза.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//  ИмяПакета - Строка - Имя package.
//  ТипРелиза - Строка - stable, rc, dev либо пустая строка.
//  ЛимитВерсий - Число - Сколько версий вернуть, 0 без ограничения.
//
// Возвращаемое значение:
//  Массив - Соответствия с данными версий.
//
Функция ПолучитьВерсииПакета(Источник, ИмяПакета, ТипРелиза = "", ЛимитВерсий = 0) Экспорт

	ОбеспечитьIDПроекта(Источник);

	Возврат ВерсииПакетаИзРелизов(ПолучитьРелизы(Источник), ИмяПакета, ТипРелиза, ЛимитВерсий);

КонецФункции

// Возвращает файлы конкретной версии пакета.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//  IDВерсии - Строка, Число - Идентификатор релиза из API.
//
// Возвращаемое значение:
//  Массив - Соответствия с описаниями файлов.
//
Функция ПолучитьФайлыВерсии(Источник, IDВерсии) Экспорт

	ОбеспечитьIDПроекта(Источник);

	Адрес = СтрШаблон("%1/releases/%2",
		АдресРепозитория(Источник),
		Формат(IDВерсии, "ЧГ=; ЧН=0"));
	Ответ = ВыполнитьЗапрос(Источник, Адрес);

	ПроверитьОтвет(Источник, Ответ, НСтр("ru = 'Не удалось получить список файлов версии пакета.'"));

	Возврат ФайлыРелиза(пм_КоннекторHTTP.КакJson(Ответ));

КонецФункции

// Скачивает файл пакета.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//  ИмяПакета - Строка - Имя package.
//  Версия - Строка - Номер версии.
//  ИмяФайла - Строка - Имя файла в релизе.
//
// Возвращаемое значение:
//  ДвоичныеДанные - Содержимое файла.
//
Функция СкачатьФайл(Источник, ИмяПакета, Версия, ИмяФайла) Экспорт

	ОбеспечитьIDПроекта(Источник);

	Релиз = НайтиРелизПоВерсии(Источник, Версия);
	Ассет = НайтиАссет(Релиз, ИмяФайла, ИмяПакета);
	Если Ассет = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Файл %1 версии %2 пакета %3 не найден в источнике.'"),
			ИмяФайла, Версия, ИмяПакета);
	КонецЕсли;

	Адрес = СтрШаблон("%1/releases/assets/%2",
		АдресРепозитория(Источник),
		Формат(Ассет.Получить("id"), "ЧГ=; ЧН=0"));

	Ответ = ВыполнитьЗапрос(Источник, Адрес, Неопределено, Истина);

	Если ЭтоКодПеренаправления(Ответ.КодСостояния) Тогда
		АдресПеренаправления = ЗаголовокОтвета(Ответ, "Location");
		Если Не ЗначениеЗаполнено(АдресПеренаправления) Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Не удалось скачать файл %1.'"), ИмяФайла);
		КонецЕсли;
		Ответ = ВыполнитьЗапросБезТокена(АдресПеренаправления);
	КонецЕсли;

	Если Ответ.КодСостояния = 404 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Файл %1 версии %2 пакета %3 не найден в источнике.'"),
			ИмяФайла, Версия, ИмяПакета);
	КонецЕсли;

	ПроверитьОтвет(Источник, Ответ, СтрШаблон(
		НСтр("ru = 'Не удалось скачать файл %1.'"), ИмяФайла));

	Если ТипЗнч(Ответ.Тело) <> Тип("ДвоичныеДанные") Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Сервер вернул файл %1 в неожиданном формате.'"), ИмяФайла);
	КонецЕсли;

	Возврат Ответ.Тело;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРелизы(Источник)

	Релизы = Новый Массив;
	НомерСтраницы = 1;

	Пока Истина Цикл

		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("per_page", 100);
		ПараметрыЗапроса.Вставить("page", НомерСтраницы);

		Ответ = ВыполнитьЗапрос(Источник, АдресРепозитория(Источник) + "/releases", ПараметрыЗапроса);
		ПроверитьОтвет(Источник, Ответ, НСтр("ru = 'Не удалось получить список релизов проекта.'"));

		Страница = пм_КоннекторHTTP.КакJson(Ответ);
		Если ТипЗнч(Страница) <> Тип("Массив") Или Страница.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;

		Для Каждого Релиз Из Страница Цикл
			Релизы.Добавить(Релиз);
		КонецЦикла;

		Если Страница.Количество() < 100 Тогда
			Прервать;
		КонецЕсли;

		НомерСтраницы = НомерСтраницы + 1;

	КонецЦикла;

	Возврат Релизы;

КонецФункции

Функция НайтиРелизПоВерсии(Источник, Версия)

	Для Каждого Тег Из КандидатыТега(Версия) Цикл

		Адрес = СтрШаблон("%1/releases/tags/%2",
			АдресРепозитория(Источник),
			КодированныйСегмент(Тег));
		Ответ = ВыполнитьЗапрос(Источник, Адрес);

		Если Ответ.КодСостояния = 404 Тогда
			Продолжить;
		КонецЕсли;

		ПроверитьОтвет(Источник, Ответ, СтрШаблон(
			НСтр("ru = 'Не удалось получить релиз версии %1.'"), Версия));

		Возврат пм_КоннекторHTTP.КакJson(Ответ);

	КонецЦикла;

	ВызватьИсключение СтрШаблон(
		НСтр("ru = 'Релиз версии %1 не найден в источнике.'"), Версия);

КонецФункции

Функция КандидатыТега(Знач Версия)

	Версия = СокрЛП(Строка(Версия));
	Кандидаты = Новый Массив;
	Кандидаты.Добавить(Версия);

	Если СтрДлина(Версия) > 0 Тогда
		ПервыйСимвол = Лев(Версия, 1);
		Если ПервыйСимвол <> "v" И ПервыйСимвол <> "V" Тогда
			Кандидаты.Добавить("v" + Версия);
		КонецЕсли;
	КонецЕсли;

	Возврат Кандидаты;

КонецФункции

Функция НайтиАссет(Релиз, ИмяФайла, ИмяПакета)

	Ассеты = АссетыРелиза(Релиз);

	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Для Каждого Ассет Из Ассеты Цикл
			Если СтрСравнить(Строка(Ассет.Получить("name")), ИмяФайла) = 0 Тогда
				Возврат Ассет;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ЗначениеЗаполнено(ИмяПакета) Тогда
		Для Каждого Ассет Из Ассеты Цикл
			Если СтрСравнить(пм_МенеджерПакетов.ИмяПакетаИзИмениФайла(Ассет.Получить("name")), ИмяПакета) = 0 Тогда
				Возврат Ассет;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция АссетыРелиза(Релиз)

	Если Релиз = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Ассеты = Релиз.Получить("assets");
	Если ТипЗнч(Ассеты) <> Тип("Массив") Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Возврат Ассеты;

КонецФункции

Функция ЭтоЧерновик(Релиз)

	Возврат Релиз.Получить("draft") = Истина;

КонецФункции

Функция РелизСодержитПакет(Релиз, ИмяПакета)

	Для Каждого Ассет Из АссетыРелиза(Релиз) Цикл
		Если СтрСравнить(пм_МенеджерПакетов.ИмяПакетаИзИмениФайла(Ассет.Получить("name")), ИмяПакета) = 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ДатаРелиза(Релиз)

	ДатаПубликации = Релиз.Получить("published_at");
	Если ЗначениеЗаполнено(ДатаПубликации) Тогда
		Возврат ДатаПубликации;
	КонецЕсли;

	Возврат Релиз.Получить("created_at");

КонецФункции

Функция НоваяСессия(Источник, ЭтоСкачивание = Ложь)

	Сессия = пм_КоннекторHTTP.СоздатьСессию();
	Сессия.Заголовки.Вставить("User-Agent", "package-manager");

	Если ЭтоСкачивание Тогда
		Сессия.Заголовки.Вставить("Accept", "application/octet-stream");
	Иначе
		Сессия.Заголовки.Вставить("Accept", "application/vnd.github+json");
	КонецЕсли;

	Если ЗначениеЗаполнено(Источник.Токен) Тогда
		Сессия.Заголовки.Вставить("Authorization", "Bearer " + Источник.Токен);
	КонецЕсли;

	Возврат Сессия;

КонецФункции

// Выполняет GET с таймаутом и одним повтором при сетевой ошибке.
// Повторяется только обрыв связи: HTTP-ответ с любым кодом считается
// состоявшимся и возвращается как есть.
Функция ВыполнитьЗапрос(Источник, Адрес, ПараметрыЗапроса = Неопределено, ЭтоСкачивание = Ложь)

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Таймаут", пм_ПровайдерыПакетов.ТаймаутЗапроса());
	Если ЭтоСкачивание Тогда
		ДополнительныеПараметры.Вставить("РазрешитьПеренаправление", Ложь);
	КонецЕсли;

	Попытка
		Возврат пм_КоннекторHTTP.Get(Адрес, ПараметрыЗапроса, ДополнительныеПараметры, НоваяСессия(Источник, ЭтоСкачивание));
	Исключение
		ОшибкаПервойПопытки = ИнформацияОбОшибке();
	КонецПопытки;

	Попытка
		Возврат пм_КоннекторHTTP.Get(Адрес, ПараметрыЗапроса, ДополнительныеПараметры, НоваяСессия(Источник, ЭтоСкачивание));
	Исключение
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Нет связи с сервером %1. Попытка повтора также не удалась.
			|%2'"),
			Источник.URLСервера,
			ПодробноеПредставлениеОшибки(ОшибкаПервойПопытки));
	КонецПопытки;

КонецФункции

Функция ВыполнитьЗапросБезТокена(Адрес)

	Сессия = пм_КоннекторHTTP.СоздатьСессию();
	Сессия.Заголовки.Вставить("User-Agent", "package-manager");

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Таймаут", пм_ПровайдерыПакетов.ТаймаутЗапроса());

	Попытка
		Возврат пм_КоннекторHTTP.Get(Адрес, Неопределено, ДополнительныеПараметры, Сессия);
	Исключение
		ОшибкаПервойПопытки = ИнформацияОбОшибке();
	КонецПопытки;

	Попытка
		Возврат пм_КоннекторHTTP.Get(Адрес, Неопределено, ДополнительныеПараметры, Сессия);
	Исключение
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Нет связи с сервером при скачивании файла. Попытка повтора также не удалась.
			|%1'"),
			ПодробноеПредставлениеОшибки(ОшибкаПервойПопытки));
	КонецПопытки;

КонецФункции

Процедура ПроверитьОтвет(Источник, Ответ, ТекстОшибки)

	Если Ответ.КодСостояния >= 200 И Ответ.КодСостояния < 300 Тогда
		Возврат;
	КонецЕсли;

	Если Ответ.КодСостояния = 401 Или Ответ.КодСостояния = 403 Тогда
		Если ЗначениеЗаполнено(Источник.Токен) Тогда
			Пояснение = НСтр("ru = 'Токен доступа отклонен или не дает права на чтение этого репозитория.'");
		Иначе
			Пояснение = НСтр("ru = 'Репозиторий приватный: заполните токен доступа в источнике.'");
		КонецЕсли;
	ИначеЕсли Ответ.КодСостояния = 404 Тогда
		Пояснение = НСтр("ru = 'Объект не найден. Проверьте путь проекта: он должен быть вида owner/repo.'");
	Иначе
		Пояснение = "";
	КонецЕсли;

	ВызватьИсключение СтрШаблон("%1 %2 %3",
		ТекстОшибки,
		СтрШаблон(НСтр("ru = 'Код ответа: %1.'"), Ответ.КодСостояния),
		Пояснение);

КонецПроцедуры

Функция АдресРепозитория(Источник)

	Сегменты = СегментыПутиРепозитория(Источник.ПутьПроекта);
	Если Сегменты.Количество() <> 2 Тогда
		ВызватьИсключение НСтр("ru = 'Путь проекта GitHub должен быть вида owner/repo.'");
	КонецЕсли;

	Возврат СтрШаблон("%1/repos/%2/%3",
		АдресПрограммногоИнтерфейса(Источник.URLСервера),
		КодированныйСегмент(Сегменты[0]),
		КодированныйСегмент(Сегменты[1]));

КонецФункции

Функция КодированныйСегмент(Знач Значение)

	Возврат КодироватьСтроку(Строка(Значение), СпособКодированияСтроки.КодировкаURL);

КонецФункции

Функция ХостИзURL(Знач URL)

	Остаток = URL;
	ПозицияСхемы = СтрНайти(Остаток, "://");
	Если ПозицияСхемы > 0 Тогда
		Остаток = Сред(Остаток, ПозицияСхемы + 3);
	КонецЕсли;

	ПозицияПути = СтрНайти(Остаток, "/");
	Если ПозицияПути > 0 Тогда
		Остаток = Лев(Остаток, ПозицияПути - 1);
	КонецЕсли;

	ПозицияПорта = СтрНайти(Остаток, ":");
	Если ПозицияПорта > 0 Тогда
		Остаток = Лев(Остаток, ПозицияПорта - 1);
	КонецЕсли;

	Возврат НРег(Остаток);

КонецФункции

Функция ЭтоХостGitHubCom(Хост)

	Возврат Хост = "github.com" Или Хост = "www.github.com" Или Хост = "api.github.com";

КонецФункции

Функция ЭтоКодПеренаправления(КодСостояния)

	Возврат КодСостояния = 301 Или КодСостояния = 302
		Или КодСостояния = 303 Или КодСостояния = 307 Или КодСостояния = 308;

КонецФункции

Функция ЗаголовокОтвета(Ответ, ИмяЗаголовка)

	Значение = Ответ.Заголовки.Получить(ИмяЗаголовка);
	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение;
	КонецЕсли;

	Для Каждого Элемент Из Ответ.Заголовки Цикл
		Если СтрСравнить(Строка(Элемент.Ключ), ИмяЗаголовка) = 0 Тогда
			Возврат Элемент.Значение;
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Разрешает идентификатор репозитория по пути и запоминает его в источнике,
// чтобы не резолвить при каждом обращении.
Процедура ОбеспечитьIDПроекта(Источник)

	Если ЗначениеЗаполнено(Источник.IDПроекта) Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Источник.ПутьПроекта) Тогда
		ВызватьИсключение НСтр("ru = 'В источнике не заполнен путь проекта.'");
	КонецЕсли;

	Сегменты = СегментыПутиРепозитория(Источник.ПутьПроекта);
	Если Сегменты.Количество() <> 2 Тогда
		ВызватьИсключение НСтр("ru = 'Путь проекта GitHub должен быть вида owner/repo.'");
	КонецЕсли;

	Ответ = ВыполнитьЗапрос(Источник, АдресРепозитория(Источник));

	Если Ответ.КодСостояния = 404 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Репозиторий %1 не найден на сервере %2.'"),
			Источник.ПутьПроекта, Источник.URLСервера);
	КонецЕсли;

	ПроверитьОтвет(Источник, Ответ, НСтр("ru = 'Не удалось получить репозиторий.'"));

	Репозиторий = пм_КоннекторHTTP.КакJson(Ответ);
	Источник.IDПроекта = Формат(Репозиторий.Получить("id"), "ЧГ=; ЧН=0");

	Справочники.пм_ИсточникиПакетов.ЗапомнитьIDПроекта(Источник.Ссылка, Источник.IDПроекта);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
